Абонементы/src/Documents/ИспользованиеУслуги/ИспользованиеУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИспользованиеУслуги</name>
  <basedOn>Document.Абонемент</basedOn>
  <registerRecords>AccumulationRegister.ДоступныеУслуги</registerRecords>
  <attributes>
    <name>Абонемент</name>
    <type>
      <types>DocumentRef.Абонемент</types>
    </type>
  </attributes>
</mdclass:Document>

Абонементы/src/AccumulationRegisters/ДоступныеУслуги/ДоступныеУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДоступныеУслуги</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Абонемент</name>
    <type>
      <types>DocumentRef.Абонемент</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Абонементы/src/Documents/ИспользованиеУслуги/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Абонемент") Тогда
		
		Абонемент = ДанныеЗаполнения;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ДоступныеУслуги.Записывать = Истина;
	
	Запись = Движения.ДоступныеУслуги.ДобавитьРасход();
	Запись.Период = Дата;
	Запись.Абонемент = Абонемент;
	Запись.Количество = 1;
	
КонецПроцедуры
